# Задача 1
# Задача 1.1.

# Есть строка с перечислением песен

my_favorite_songs = 'Waste a Moment, Staying\' Alive, A Sorta Fairytale, Start Me Up, New Salvation'
# Выведите на консоль с помощью индексации строки, последовательно: первый трек, последний, второй, второй с конца
# Нельзя переопределять my_favorite_songs и запятая не должна выводиться.

#РЕШЕНИЕ:

my_favorite_songs = ["Waste a Moment", "Staying\' Alive", "A Sorta Fairytale", "Start Me Up", "New Salvation"]

print(my_favorite_songs[0], my_favorite_songs[4], my_favorite_songs[1], my_favorite_songs [3])